RT-Thread/rt-thread/bsp/mm32l3xx/Libraries/MM32L3xx/Include/MM32L3xx.h
  __IO uint32_t  RESERVED20;            /*!           Address offset: 0xC0 */
  __IO uint32_t  RESERVED21;            /*!           Address offset: 0xC4 */
  __IO uint32_t  RESERVED22;            /*!           Address offset: 0xC8 */
  __IO uint32_t  RESERVED23;            /*!           Address offset: 0xCC */

  __IO uint32_t  RESERVED24;            /*!           Address offset: 0xD0 */
  __IO uint32_t  RESERVED25;            /*!           Address offset: 0xD4 */
  __IO uint32_t  RESERVED26;            /*!           Address offset: 0xD8 */
  __IO uint32_t  RESERVED27;            /*!           Address offset: 0xDC */

  __IO uint32_t  RESERVED28;            /*!           Address offset: 0xE0 */
  __IO uint32_t  RESERVED29;            /*!           Address offset: 0xE4 */
  __IO uint32_t  RESERVED30;            /*!           Address offset: 0xE8 */
  __IO uint32_t  RESERVED31;            /*!           Address offset: 0xEC */

  __IO uint32_t  RESERVED32;            /*!           Address offset: 0xF0 */
  __IO uint32_t  RESERVED33;            /*!           Address offset: 0xF4 */
  __IO uint32_t  RESERVED34;            /*!           Address offset: 0xF8 */
  __IO uint32_t  RESERVED35;            /*!           Address offset: 0xFC */

  __IO uint32_t  rEP0_AVIL;         /*!           Address offset: 0x100 */
  __IO uint32_t  rEP1_AVIL;         /*!           Address offset: 0x104 */
  __IO uint32_t  rEP2_AVIL;         /*!           Address offset: 0x108 */
  __IO uint32_t  rEP3_AVIL;         /*!           Address offset: 0x10C */
  __IO uint32_t  rEP4_AVIL;         /*!           Address offset: 0x110 */

  __IO uint32_t  RESERVED36;            /*!           Address offset: 0x114 */
  __IO uint32_t  RESERVED37;            /*!           Address offset: 0x118 */
  __IO uint32_t  RESERVED38;            /*!           Address offset: 0x11C */
  __IO uint32_t  RESERVED39;            /*!           Address offset: 0x120 */

  __IO uint32_t  RESERVED40;            /*!           Address offset: 0x124 */
  __IO uint32_t  RESERVED41;            /*!           Address offset: 0x128 */
  __IO uint32_t  RESERVED42;            /*!           Address offset: 0x12C */
  __IO uint32_t  RESERVED43;            /*!           Address offset: 0x130 */

  __IO uint32_t  RESERVED44;            /*!           Address offset: 0x134 */
  __IO uint32_t  RESERVED45;            /*!           Address offset: 0x138 */
  __IO uint32_t  RESERVED46;            /*!           Address offset: 0x13C */

  __IO uint32_t  rEP0_CTRL;         /*!           Address offset: 0x140 */
  __IO uint32_t  rEP1_CTRL;         /*!           Address offset: 0x144 */
  __IO uint32_t  rEP2_CTRL;         /*!           Address offset: 0x148 */
  __IO uint32_t  rEP3_CTRL;         /*!           Address offset: 0x14C */
  __IO uint32_t  rEP4_CTRL;         /*!           Address offset: 0x150 */

  __IO uint32_t  RESERVED47;            /*!           Address offset: 0x154 */
  __IO uint32_t  RESERVED48;            /*!           Address offset: 0x158 */
  __IO uint32_t  RESERVED49;            /*!           Address offset: 0x15C */
  //__IO uint32_t  RESERVED50;          /*!           Address offset: 0x15C */

  //__IO uint32_t  rEPn_FIFO[5];            /*!           Address offset: 0x160 */

  __IO uint32_t  rEP0_FIFO;         /*!           Address offset: 0x160 */
  __IO uint32_t  rEP1_FIFO;         /*!           Address offset: 0x164 */
  __IO uint32_t  rEP2_FIFO;         /*!           Address offset: 0x168 */
  __IO uint32_t  rEP3_FIFO;         /*!           Address offset: 0x16C */
  __IO uint32_t  rEP4_FIFO;         /*!           Address offset: 0x170 */

  __IO uint32_t  RESERVED51;            /*!           Address offset: 0x174 */
  __IO uint32_t  RESERVED52;            /*!           Address offset: 0x178 */
  __IO uint32_t  RESERVED53;            /*!           Address offset: 0x17C */

  __IO uint32_t  RESERVED54;            /*!           Address offset: 0x180 */

  __IO uint32_t  rEP_DMA;               /*!           Address offset: 0x184 */
  __IO uint32_t  rEP_HALT;          /*!           Address offset: 0x188 */
  __IO uint32_t  RESERVED55;            /*!           Address offset: 0x18C */

  __IO uint32_t  RESERVED56;            /*!           Address offset: 0x190 */
  __IO uint32_t  RESERVED57;            /*!           Address offset: 0x194 */
  __IO uint32_t  RESERVED58;            /*!           Address offset: 0x198 */
  __IO uint32_t  RESERVED59;            /*!           Address offset: 0x19C */

  __IO uint32_t  RESERVED60;            /*!           Address offset: 0x1A0 */
  __IO uint32_t  RESERVED61;            /*!           Address offset: 0x1A4 */
  __IO uint32_t  RESERVED62;            /*!           Address offset: 0x1A8 */
  __IO uint32_t  RESERVED63;            /*!           Address offset: 0x1AC */

  __IO uint32_t  RESERVED64;            /*!           Address offset: 0x1B0 */
  __IO uint32_t  RESERVED65;            /*!           Address offset: 0x1B4 */
  __IO uint32_t  RESERVED66;            /*!           Address offset: 0x1B8 */
  __IO uint32_t  RESERVED67;            /*!           Address offset: 0x1BC */
  __IO uint32_t  rPOWER;                /*!           Address offset: 0x1C0 */
} USB_TypeDef;

/**
* @}
*/

#define HARD_FAULT_MM         ((HARD_FAULT_TypeDef*)0xE000DE24)

/** @addtogroup Peripheral_memory_map
* @{
*/

#define FLASH_BASE            ((uint32_t)0x08000000) /*!< FLASH base address in the alias region */
#define PERIPH_BB_BASE        ((uint32_t)0x42000000) /*!< Peripheral base address in the alias region */
#define SRAM_BB_BASE          ((uint32_t)0x22000000) /*!< SRAM base address in the alias region */

#define SRAM_BASE             ((uint32_t)0x20000000) /*!< Peripheral base address in the bit-band region */
#define PERIPH_BASE           ((uint32_t)0x40000000) /*!< SRAM base address in the bit-band region */



/*!< Peripheral memory map */
#define APB1PERIPH_BASE       PERIPH_BASE
#define APB2PERIPH_BASE       (PERIPH_BASE + 0x10000)
#define AHBPERIPH_BASE        (PERIPH_BASE + 0x20000)


