RT-Thread/rt-thread/bsp/mm32l3xx/Libraries/MM32L3xx/Include/MM32L3xx.h
/*******************  Bit definition for CAN_AMR1 register  *******************/
#define  CAN_AMR1_AM                          ((uint16_t)0x00FF)
#define  CAN_AMR1_AM_0                        ((uint16_t)0x0001)
#define  CAN_AMR1_AM_1                        ((uint16_t)0x0002)
#define  CAN_AMR1_AM_2                        ((uint16_t)0x0004)
#define  CAN_AMR1_AM_3                        ((uint16_t)0x0008)
#define  CAN_AMR1_AM_4                        ((uint16_t)0x0010)
#define  CAN_AMR1_AM_5                        ((uint16_t)0x0020)
#define  CAN_AMR1_AM_6                        ((uint16_t)0x0040)
#define  CAN_AMR1_AM_7                        ((uint16_t)0x0080)

/*******************  Bit definition for CAN_AMR2 register  *******************/
#define  CAN_AMR2_AM                          ((uint16_t)0x00FF)
#define  CAN_AMR2_AM_0                        ((uint16_t)0x0001)
#define  CAN_AMR2_AM_1                        ((uint16_t)0x0002)
#define  CAN_AMR2_AM_2                        ((uint16_t)0x0004)
#define  CAN_AMR2_AM_3                        ((uint16_t)0x0008)
#define  CAN_AMR2_AM_4                        ((uint16_t)0x0010)
#define  CAN_AMR2_AM_5                        ((uint16_t)0x0020)
#define  CAN_AMR2_AM_6                        ((uint16_t)0x0040)
#define  CAN_AMR2_AM_7                        ((uint16_t)0x0080)

/*******************  Bit definition for CAN_AMR3 register  *******************/
#define  CAN_AMR3_AM                          ((uint16_t)0x00FF)
#define  CAN_AMR3_AM_0                        ((uint16_t)0x0001)
#define  CAN_AMR3_AM_1                        ((uint16_t)0x0002)
#define  CAN_AMR3_AM_2                        ((uint16_t)0x0004)
#define  CAN_AMR3_AM_3                        ((uint16_t)0x0008)
#define  CAN_AMR3_AM_4                        ((uint16_t)0x0010)
#define  CAN_AMR3_AM_5                        ((uint16_t)0x0020)
#define  CAN_AMR3_AM_6                        ((uint16_t)0x0040)
#define  CAN_AMR3_AM_7                        ((uint16_t)0x0080)

/*******************  Bit definition for CAN_RMC register  *******************/
#define  CAN_RMC_RMC                          ((uint16_t)0x001F)

/*******************  Bit definition for CAN_RBSA register  *******************/
#define  CAN_RBSA_RBSA                        ((uint16_t)0x003F)

/**
* @}
*/

/**
* @}
*/

#ifdef USE_STDPERIPH_DRIVER
#include "HAL_conf.h"
#endif

/** @addtogroup Exported_macro
* @{
*/

#define SET_BIT(REG, BIT)     ((REG) |= (BIT))

#define CLEAR_BIT(REG, BIT)   ((REG) &= ~(BIT))

#define READ_BIT(REG, BIT)    ((REG) & (BIT))

#define CLEAR_REG(REG)        ((REG) = (0x0))

#define WRITE_REG(REG, VAL)   ((REG) = (VAL))

#define READ_REG(REG)         ((REG))

#define MODIFY_REG(REG, CLEARMASK, SETMASK)  WRITE_REG((REG), (((READ_REG(REG)) & (~CLEARMASK)) | (SETMASK)))



/* Exported macro ------------------------------------------------------------*/
#ifdef  USE_FULL_ASSERT

/**
* @brief  The assert_param macro is used for function's parameters check.
* @param expr: If expr is false, it calls assert_failed function
*   which reports the name of the source file and the source
*   line number of the call that failed.
*   If expr is true, it returns no value.
* @retval : None
*/
#define assert_param(expr) ((expr) ? (void)0 : assert_failed((uint8_t *)__FILE__, __LINE__))
/* Exported functions ------------------------------------------------------- */
void assert_failed(uint8_t* file, uint32_t line);
#else
#define assert_param(expr) ((void)0)
#endif /* USE_FULL_ASSERT */


/**
* @}
*/

#endif /* __MM32L3xx_H */

/**
* @}
*/

/**
* @}
*/

/*-------------------------(C) COPYRIGHT 2017 MindMotion ----------------------*/
